// Задача 32: Напишите программу замена элементов массива:
// положительные элементы замените на соответствующие отрицательные, 
//и наоборот.
// [-4, -8, 8, 2] -> [4, 8, -8, -2]

int [] array = new int[4] {-4 ,-8 ,8, 2};
for (int i = 0 ; i<4 ; i++)
{
    array[i] = array[i] *-1;
    System.Console.Write(array[i]);
}






// Задача 33: Задайте массив. Напишите программу, 
//которая определяет, присутствует ли заданное число в массиве.
// 4; массив [6, 7, 19, 345, 3] -> нет
// 3; массив [6, 7, 19, 345, 3] -> да



// int [] array = new int[5] {6 ,7 ,19,345,3};
// int q = 5;
// bool w = false;
// for (int i = 0 ; i<5 ; i++)
// {   if (array[i] == q)
//     {
//         w = true;
//     }
// }
//     if (w == false)
//     {
//     System.Console.Write("no");     
//     }
//     else System.Console.Write("da");

